grevaillot/svd_tools/headers/STM32F302/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define I2S2ext_BASE			(0x40003400)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define I2S3ext_BASE			(0x40004000)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define UART4_BASE			(0x40004c00)
#define UART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define USB_FS_BASE			(0x40005c00)
#define CAN_BASE			(0x40006400)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define I2C3_BASE			(0x40007800)
#define SYSCFG_COMP_OPAMP_BASE			(0x40010000)
#define EXTI_BASE			(0x40010400)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define TIM8_BASE			(0x40013400)
#define USART1_BASE			(0x40013800)
#define SPI4_BASE			(0x40013c00)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define TIM17_BASE			(0x40014800)
#define TIM20_BASE			(0x40015000)
#define DMA1_BASE			(0x40020000)
#define DMA2_BASE			(0x40020400)
#define RCC_BASE			(0x40021000)
#define Flash_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define TSC_BASE			(0x40024000)
#define GPIOA_BASE			(0x48000000)
#define GPIOB_BASE			(0x48000400)
#define GPIOC_BASE			(0x48000800)
#define GPIOD_BASE			(0x48000c00)
#define GPIOE_BASE			(0x48001000)
#define GPIOF_BASE			(0x48001400)
#define GPIOG_BASE			(0x48001800)
#define GPIOH_BASE			(0x48001c00)
#define ADC1_BASE			(0x50000000)
#define ADC2_BASE			(0x50000100)
#define ADC1_2_BASE			(0x50000300)
#define ADC3_BASE			(0x50000400)
#define ADC4_BASE			(0x50000500)
#define ADC3_4_BASE			(0x50000700)
#define FMC_BASE			(0xa0000000)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define FPU_CPACR_BASE			(0xe000ed88)
#define MPU_BASE			(0xe000ed90)
#define NVIC_STIR_BASE			(0xe000ef00)
#define FPU_BASE			(0xe000ef34)
#define DBGMCU_BASE			(0xe0042000)
